; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	thermograph2 - mode
	infrared1 - mode
	infrared3 - mode
	thermograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet5)
	(supports instrument8 thermograph0)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star13)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite1 GroundStation0)
	(pointing satellite2 Planet10)
	(pointing satellite3 GroundStation4)
	(pointing satellite4 Phenomenon12)
	(have_image Planet5 infrared1)
	(have_image Planet6 infrared1)
	(have_image Star7 infrared3)
	(have_image Planet8 thermograph0)
	(have_image Planet9 thermograph2)
	(have_image Planet10 thermograph2)
	(have_image Planet11 thermograph0)
	(have_image Phenomenon12 thermograph2)
	(have_image Star13 thermograph0)
	(have_image Planet14 thermograph2)
))

)

; plan
1. (turn_to satellite4 phenomenon12 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 15
2. (turn_to satellite3 groundstation4 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 groundstation4)
   goals met: 2 of 15
3. (turn_to satellite2 planet10 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet10)
   goals met: 3 of 15
4. (turn_to satellite1 groundstation1 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 15
5. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 15
6. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 3 of 15
7. (turn_to satellite1 planet8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet8)
   goals met: 3 of 15
8. (take_image satellite1 planet8 instrument2 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 4 of 15
9. (turn_to satellite1 planet6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet6)
   goals met: 4 of 15
10. (take_image satellite1 planet6 instrument2 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 5 of 15
11. (turn_to satellite1 planet5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet5)
   goals met: 5 of 15
12. (take_image satellite1 planet5 instrument2 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 6 of 15
13. (turn_to satellite1 planet11 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet11)
   goals met: 6 of 15
14. (turn_to satellite0 star3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star3)
   goals met: 6 of 15
15. (take_image satellite1 planet11 instrument2 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 7 of 15
16. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 7 of 15
17. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 7 of 15
18. (turn_to satellite0 phenomenon12 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon12)
   goals met: 7 of 15
19. (take_image satellite0 phenomenon12 instrument0 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 8 of 15
20. (turn_to satellite0 planet10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet10)
   goals met: 8 of 15
21. (take_image satellite0 planet10 instrument0 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 9 of 15
22. (turn_to satellite0 planet14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet14)
   goals met: 9 of 15
23. (take_image satellite0 planet14 instrument0 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 10 of 15
24. (turn_to satellite0 planet9 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet9)
   goals met: 10 of 15
25. (take_image satellite0 planet9 instrument0 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 11 of 15
26. (turn_to satellite0 star7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star7)
   goals met: 11 of 15
27. (take_image satellite0 star7 instrument0 infrared3)
   added: (have_image star7 infrared3)
   goals met: 12 of 15
28. (turn_to satellite0 groundstation4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation4)
   goals met: 13 of 15
29. (turn_to satellite1 star13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star13)
   goals met: 13 of 15
30. (take_image satellite1 star13 instrument2 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 14 of 15
31. (turn_to satellite1 groundstation0 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 groundstation0)
   goals met: 15 of 15
